In [2]:
import pandas as pd
df=pd.read_csv('weather_data.csv')

In [3]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
rows, columns=df.shape

In [9]:
columns

4

In [16]:
df.tail(1)

        day  temperature  windspeed  event
5  1/6/2017           31          2  Sunny

In [19]:
df[0:7]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [20]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [21]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [24]:
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [25]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [26]:
type(df['event'])

pandas.core.series.Series

In [31]:
df[['event','day']]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

In [32]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [38]:
df['temperature'].std()

3.8297084310253524

In [39]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [45]:
df[['day','temperature']][df.temperature==df.temperature.max()]

        day  temperature
1  1/2/2017           35

In [46]:
df[5]

KeyError: 5

In [49]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [50]:
df.set_index('day')

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [52]:
df=df.set_index('day')

In [55]:
df.loc['1/1/2017']

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

In [75]:
df.reset_index()

   index  temperature  windspeed
0      0           32          6
1      1           35          7
2      2           28          2
3      3           24          7
4      4           32          4
5      5           31          2

In [72]:
df

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

In [67]:
df=df.set_index('temperature',inplace=True)

KeyError: "None of ['temperature'] are in the columns"

In [77]:
df

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

In [69]:
df.reset_index

<bound method DataFrame.reset_index of              windspeed
temperature
32                   6
35                   7
28                   2
24                   7
32                   4
31                   2>

In [73]:
df

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

TypeError: reset_index() missing 1 required positional argument: 'self'

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

In [78]:
df

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

In [79]:
df.reset_index(drop=True, inplace=True)

In [80]:
df

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

In [82]:
df.drop('event', axis=1, inplace=True)

KeyError: "['event'] not found in axis"

In [85]:
df.reset_index(inplace=True)
df

   level_0  index  temperature  windspeed
0        0      0           32          6
1        1      1           35          7
2        2      2           28          2
3        3      3           24          7
4        4      4           32          4
5        5      5           31          2

In [84]:
df

   index  temperature  windspeed
0      0           32          6
1      1           35          7
2      2           28          2
3      3           24          7
4      4           32          4
5      5           31          2

In [86]:
df

   level_0  index  temperature  windspeed
0        0      0           32          6
1        1      1           35          7
2        2      2           28          2
3        3      3           24          7
4        4      4           32          4
5        5      5           31          2

In [90]:
df=pd.read_csv('weather_data.csv')

In [91]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [93]:
df.loc['Snow']

KeyError: 'Snow'

In [94]:
df.set_index('event',inplace=True)

In [95]:
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [100]:
df.loc['Snow']

            day  temperature  windspeed
event
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7

# DATA FRAME IN PANDAS

In [102]:
import pandas as pd

df=pd.read_csv('weather_data.csv')

In [103]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [110]:
weather_data_from_dictinoary={
    'day':['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature':[32,35,28,24,32,31],
    'windspeed':[6,7,2,7,4,2],
    'event':['Rain','Sunny','Snow','snow','Rain','Sunny']
}

In [111]:
weather_data_from_dictionary

{'day': ['1/1/2017',
  '1/2/2017',
  '1/3/2017',
  '1/4/2017',
  '1/5/2017',
  '1/6/2017'],
 'temperature': [32, 35, 28, 24, 32, 31],
 'windspeed': [6, 7, 2, 7, 4, 2],
 'event': ['Rain', 'Sunny', 'Snow', 'snow', 'Rain', 'Sunny']}

In [112]:
pd.DataFrame(weather_data_from_dictinoary)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [113]:
df1=pd.DataFrame(weather_data_from_dictinoary)

In [114]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [115]:
import csv

In [116]:
df2=pd.DataFrame.from_dict(df1)

In [117]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [118]:
df2.to_csv('weather_data_from_dictionary.csv',index=False)

In [122]:
df3=pd.read_csv('weather_data_from_dictionary.csv')

In [123]:
df3

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [124]:
type(df3)

pandas.core.frame.DataFrame

In [125]:
df={
   "firstName": "Joe",
   "lastName": "Jackson",
   "gender": "male",
   "age": 28,
   "address": {
       "streetAddress": "101",
       "city": "San Diego",
       "state": "CA"
   },
   "phoneNumbers": [
       { "type": "home", "number": "7349282382" }
   ]
}

In [126]:
df

{'firstName': 'Joe',
 'lastName': 'Jackson',
 'gender': 'male',
 'age': 28,
 'address': {'streetAddress': '101', 'city': 'San Diego', 'state': 'CA'},
 'phoneNumbers': [{'type': 'home', 'number': '7349282382'}]}

In [130]:
df.to_csv('json_file_to_csv_file.csv',index=None)

AttributeError: 'dict' object has no attribute 'to_csv'

In [131]:
df

{'firstName': 'Joe',
 'lastName': 'Jackson',
 'gender': 'male',
 'age': 28,
 'address': {'streetAddress': '101', 'city': 'San Diego', 'state': 'CA'},
 'phoneNumbers': [{'type': 'home', 'number': '7349282382'}]}

In [134]:
df=pd.read_json('json_file.json',orient='index')

In [135]:
df

                                                              0
firstName                                                   Joe
lastName                                                Jackson
gender                                                     male
age                                                          28
address       {'streetAddress': '101', 'city': 'San Diego', ...
phoneNumbers         [{'type': 'home', 'number': '7349282382'}]

In [137]:
df.to_csv('json_file_to_csv.csv')

# WORKING WITH EXCEL FILE

In [176]:
import pandas as pd
df=pd.read_csv("stock_data.csv",na_values=['not available','n.a.'])

In [177]:
df

  ticker    eps  revenue   price         people
0  GOOGL  27.82       87   845.0     larry page
1    WMT   4.61      484    65.0            NaN
2   MSFT  -1.00       85    64.0     bill gates
3   RIL     NaN       50  1023.0  mukesh ambani
4   TATA   5.60       -1     NaN     ratan tata

In [163]:
df.head(3)

  ticker    eps  revenue price      people
0  GOOGL  27.82       87   845  larry page
1    WMT   4.61      484    65        n.a.
2   MSFT     -1       85    64  bill gates

In [164]:
df

  ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3   RIL   not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

In [165]:
df.na_values=["not available","n.a."]

C:\Users\mrsud\AppData\Local\Temp\ipykernel_15804\2536483246.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.na_values=["not available","n.a."]

In [172]:
df

  ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3   RIL   not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

In [173]:
df.pd

AttributeError: 'DataFrame' object has no attribute 'pd'

In [178]:
df

  ticker    eps  revenue   price         people
0  GOOGL  27.82       87   845.0     larry page
1    WMT   4.61      484    65.0            NaN
2   MSFT  -1.00       85    64.0     bill gates
3   RIL     NaN       50  1023.0  mukesh ambani
4   TATA   5.60       -1     NaN     ratan tata

In [181]:
df1=pd.read_csv("stock_data.csv",na_values={
    'eps':['not available','n.a.'],
    'revenue':['not available','n.a.',-1],
    'people':['not available','n.a.'],
    'price':['not available','n.a.']
})

In [182]:
df1

  ticker    eps  revenue   price         people
0  GOOGL  27.82     87.0   845.0     larry page
1    WMT   4.61    484.0    65.0            NaN
2   MSFT  -1.00     85.0    64.0     bill gates
3   RIL     NaN     50.0  1023.0  mukesh ambani
4   TATA   5.60      NaN     NaN     ratan tata

In [195]:
df1.to_csv('cleaned_csv_stock_data_file.csv',index=False)

In [196]:
df1.columns

Index(['ticker', 'eps', 'revenue', 'price', 'people'], dtype='object')

# WORKING WITH EXCEL FILE

In [193]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell
def convert_eps_cell(cell):
    if cell=="not available":
        return "NaN"
    return cell

def convert_price_cell(cell):
    if cell=="n.a.":
        return "NaN"
    return cell

df=pd.read_excel('stock_data.xlsx',converters={
    'people':convert_people_cell,
    'eps':convert_eps_cell,
    'price':convert_price_cell
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT     -1       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA    5.6       -1   NaN     ratan tata

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [194]:
df.to_excel('cleaned_excel_stock_data_file.xlsx',index=False)

In [198]:
df1=pd.read_excel('stock_data.xlsx')

In [199]:
df1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [200]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT     -1       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA    5.6       -1   NaN     ratan tata

In [201]:
df1

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [203]:
with pd.ExcelWriter('writing_2_data_to_same_excel_file.xlsx') as writer:
    df1.to_excel(writer,sheet_name='uncleaned data',index=False)
    df.to_excel(writer,sheet_name='cleaned data',index=False)